Autodesk.Revit.DB.Structure.AreaReinforcementLayerType
Describes the layers of an Area Reinforcement
Since:
2022
Since:
2022

Autodesk.Revit.DB.Structure.AreaReinforcementLayerType.BottomOrBackMinor
Reinforcement layer is on the bottom face of a floor host, or on the back face of a wall host in the minor direction.

Autodesk.Revit.DB.Structure.AreaReinforcementLayerType.BottomOrBackMajor
Reinforcement layer is on the bottom face of a floor host, or on the back face of a wall host in the major direction.

Autodesk.Revit.DB.Structure.AreaReinforcementLayerType.TopOrFrontMinor
Reinforcement layer is on the top face of a floor host, or on the front face of a wall host in the minor direction.

Autodesk.Revit.DB.Structure.AreaReinforcementLayerType.TopOrFrontMajor
Reinforcement layer is on the top face of a floor host, or on the front face of a wall host in the major direction.